<a href="https://colab.research.google.com/github/UznetDev/Data-science-home-work/blob/main/16_Avg_2024.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [17]:
# Set-up
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [18]:
import pandas as pd
import numpy as np
from sklearn.metrics import *
from sklearn.model_selection import *
from sklearn.linear_model import *
from sklearn.datasets import *

In [19]:
# Load the California Housing dataset and save it as CSV
california_housing = fetch_california_housing(as_frame=True)
df = california_housing.frame
df.to_csv('Dataset.csv', index=False)

# Open and load the CSV into a pandas DataFrame
with open('Dataset.csv') as f:
    california = pd.read_csv(f, encoding='unicode_escape')

# Drop the table if it exists, then persist the DataFrame to the SQL database
%sql DROP TABLE IF EXISTS california;
%sql --persist california

 * sqlite://
Done.
 * sqlite://

'Persisted california'

In [20]:
%%sql SELECT * FROM california LIMIT 5

 * sqlite://
Done.

[(0, 8.3252, 41.0, 6.984126984126984, 1.0238095238095235, 322.0, 2.555555555555556, 37.88, -122.23, 4.526),
 (1, 8.3014, 21.0, 6.238137082601054, 0.9718804920913884, 2401.0, 2.109841827768014, 37.86, -122.22, 3.585),
 (2, 7.2574, 52.0, 8.288135593220339, 1.073446327683616, 496.0, 2.8022598870056497, 37.85, -122.24, 3.521),
 (3, 5.6431, 52.0, 5.817351598173516, 1.0730593607305936, 558.0, 2.547945205479452, 37.85, -122.25, 3.413),
 (4, 3.8462, 52.0, 6.281853281853282, 1.0810810810810811, 565.0, 2.1814671814671813, 37.85, -122.25, 3.422)]

In [21]:
%%sql SELECT * FROM
california LIMIT 5;

 * sqlite://
Done.

[(0, 8.3252, 41.0, 6.984126984126984, 1.0238095238095235, 322.0, 2.555555555555556, 37.88, -122.23, 4.526),
 (1, 8.3014, 21.0, 6.238137082601054, 0.9718804920913884, 2401.0, 2.109841827768014, 37.86, -122.22, 3.585),
 (2, 7.2574, 52.0, 8.288135593220339, 1.073446327683616, 496.0, 2.8022598870056497, 37.85, -122.24, 3.521),
 (3, 5.6431, 52.0, 5.817351598173516, 1.0730593607305936, 558.0, 2.547945205479452, 37.85, -122.25, 3.413),
 (4, 3.8462, 52.0, 6.281853281853282, 1.0810810810810811, 565.0, 2.1814671814671813, 37.85, -122.25, 3.422)]

In [34]:
%%sql SELECT `HouseAge`, `index`, `Latitude`, `Longitude`  FROM
`california` LIMIT 5;

 * sqlite://
Done.

[(41.0, 0, 37.88, -122.23),
 (21.0, 1, 37.86, -122.22),
 (52.0, 2, 37.85, -122.24),
 (52.0, 3, 37.85, -122.25),
 (52.0, 4, 37.85, -122.25)]

In [55]:
# Read datasets from CSV files
films = pd.read_csv('films.csv', header=None)
films = films.rename(columns={0: 'id',
                              1: 'title',
                              2: 'releas_date',
                              3: 'country',
                              4: 'duratioon',
                              5: 'language',
                              6: 'certificatipon',
                              7: 'gross',
                              8: 'budget'})
reviews = pd.read_csv('reviews.csv', header=None)
reviews = reviews.rename(columns={0: 'id',
                                  1: 'film_id',
                                  2: 'num_user',
                                  3: 'num_critic',
                                  4: 'imdb_score',
                                  5: 'num_votes',
                                  6: 'facebook_likes'})
people = pd.read_csv('people.csv', header=None)
people = people.rename(columns={0: 'id',
                                1: 'name',
                                2: 'birthdate',
                                3: 'deathdate'})
roles = pd.read_csv('roles.csv', header=None)
roles = roles.rename(columns={0: 'id',
                              1: 'film_id',
                              2: 'person_id',
                              3: 'role'})

# Drop tables if they exist, then persist the DataFrames to the SQL database
%sql DROP TABLE IF EXISTS films;
%sql --persist films

%sql DROP TABLE IF EXISTS reviews;
%sql --persist reviews

%sql DROP TABLE IF EXISTS people;
%sql --persist people

%sql DROP TABLE IF EXISTS roles;
%sql --persist roles

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.
 * sqlite://

'Persisted roles'

In [47]:
%%sql select * from films limit 2

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0),
 (1, 2, 'Over the Hill to the Poorhouse', 1920.0, 'USA', 110.0, None, None, 3000000.0, 100000.0)]

In [48]:
%%sql select * from reviews limit 2

 * sqlite://
Done.

[(0, 3934, 588.0, 432.0, 7.0999999, 203461, 46000),
 (1, 3405, 285.0, 267.0, 6.4000001, 149998, 0)]

In [49]:
%%sql select * from people limit 2

 * sqlite://
Done.

[(0, 1, '50 Cent', '1975-07-06', None),
 (1, 2, 'A. Michael Baldwin', '1963-04-04', None)]

In [51]:
%%sql select * from roles limit 2

 * sqlite://
Done.

[(0, 1, 1, 1630, 'director'), (1, 2, 1, 4843, 'actor')]

In [56]:
%%sql select * from films as fm
inner join reviews as rv
on fm.id = rv.film_id
inner join roles as rl
on fm.id = rl.film_id
inner join people as ps
on rl.person_id = ps.id
limit 2

 * sqlite://
Done.

[(0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0, 63, 3016, 1.0, 5.0, 7.4000001, 59, 18, 0, 1, 1, 1630, 'director', 1629, 1630, 'D.W. Griffith', '1875-01-22', '1948-07-23'),
 (0, 1, "Intolerance: Love's Struggle Throughout the Ages", 1916.0, 'USA', 123.0, None, 'Not Rated', None, 385907.0, 63, 3016, 1.0, 5.0, 7.4000001, 59, 18, 1, 2, 1, 4843, 'actor', 4842, 4843, 'Lillian Gish', '1893-10-14', '1993-02-27')]